Напишите программу, которая использует метод Монте-
Карло для приближенного вычисления числа Пи. Каждый процесс должен
генерировать случайные точки в квадрате и определять, находятся ли они
внутри круга. Затем все процессы должны использовать alltoall, чтобы об-
меняться своими результатами и вычислить общее количество точек внутри
 круга. Используйте это число для вычисления приближенного значения Пи.
В конце каждый процесс должен вывести свои исходные данные, получен-
ные данные и приближенное значение Пи.


Для реализации программы, использующей метод Монте-Карло для приближенного вычисления числа Пи с помощью MPI и функции `alltoall`, выполните следующие шаги:

```python
from mpi4py import MPI
import numpy as np

def monte_carlo_pi(total_points):
    comm = MPI.COMM_WORLD
    rank = comm.Get_rank()
    size = comm.Get_size()

    # Генерация случайных координат точек в квадрате [0, 1] x [0, 1]
    points_per_process = total_points // size
    points_inside_circle = 0
    for _ in range(points_per_process):
        x = np.random.uniform(0, 1)
        y = np.random.uniform(0, 1)
        if x**2 + y**2 <= 1:
            points_inside_circle += 1

    # Обмен результатами с помощью alltoall
    all_points_inside_circle = comm.allgather(points_inside_circle)

    # Вычисление общего числа точек внутри круга
    total_points_inside_circle = sum(all_points_inside_circle)

    # Приближенное вычисление числа Пи
    pi_approx = 4 * total_points_inside_circle / total_points

    # Вывод результатов
    print(f"Процесс {rank}: Исходные данные - {points_per_process} точек, "
          f"точек внутри круга - {points_inside_circle}, приближенное значение Пи - {pi_approx}")

def main():
    total_points = 1000000  # Общее количество точек
    monte_carlo_pi(total_points)

if __name__ == "__main__":
    main()
```

### Описание программы:
1. Инициализация MPI и получение ранга процесса и количества процессов.
2. Каждый процесс генерирует случайные координаты точек в квадрате [0, 1] x [0, 1].
3. Для каждой точки проверяется, находится ли она внутри круга с радиусом 1 и центром в начале координат.
4. Обмен результатами с помощью функции `alltoall`, чтобы каждый процесс знал количество точек внутри круга, найденных другими процессами.
5. Вычисление общего количества точек внутри круга суммированием результатов от всех процессов.
6. Приближенное вычисление числа Пи по формуле: Pi ≈ 4 * (точки внутри круга) / (общее количество точек).
7. Вывод результатов для каждого процесса, включая исходные данные, количество точек внутри круга и приближенное значение Пи.

### Запуск программы
Для запуска программы с использованием нескольких процессов MPI, выполните следующую команду в командной строке:

```sh
mpiexec -n 4 python your_script.py
```

Здесь `your_script.py` — это имя вашего файла Python, а `-n 4` указывает на запуск программы с четырьмя процессами. Вы можете изменить количество процессов по вашему усмотрению.

### Пример вывода
Пример вывода будет зависеть от количества процессов и точности метода Монте-Карло. Каждый процесс выведет свои исходные данные, количество точек внутри круга и приближенное значение числа Пи.