Напишите программу на Python, используя модуль `mpi4py`, которая
запрашивает у пользователя ввод серии целых чисел на процессе с рангом
0, распространяет эти числа на все процессы с помощью функции
`comm.scatter`, затем каждый процесс увеличивает свое число на 1 и соби-
рает обновленные числа обратно на процессе с рангом 0 с помощью функ-
ции `comm.gather`. На процессе с рангом 0 должны быть выведены исходная
серия чисел и обновленная серия чисел.


Для реализации программы, использующей `mpi4py` и функции `comm.scatter` и `comm.gather` для обработки пользовательского ввода, выполните следующие шаги. Программа будет запрашивать у пользователя ввод серии целых чисел на процессе с рангом 0, распространять эти числа на все процессы, каждый процесс увеличивает свое число на 1, и затем собирает обновленные числа обратно на процессе с рангом 0.

### Программа

```python
from mpi4py import MPI

def main():
    comm = MPI.COMM_WORLD
    rank = comm.Get_rank()
    size = comm.Get_size()

    # Запрос ввода серии целых чисел на процессе с рангом 0
    if rank == 0:
        user_input = input("Введите серию целых чисел, разделенных пробелом: ")
        data = [int(x) for x in user_input.split()]
        # Убедимся, что количество чисел совпадает с количеством процессов
        if len(data) != size:
            raise ValueError(f"Необходимо ввести ровно {size} целых чисел.")
        print(f"Исходная серия чисел: {data}")
    else:
        data = None

    # Распределение чисел на все процессы
    number = comm.scatter(data, root=0)

    # Увеличение числа на 1 в каждом процессе
    number += 1

    # Сбор обновленных чисел на процессе с рангом 0
    new_data = comm.gather(number, root=0)

    # Вывод исходной и обновленной серии чисел на процессе с рангом 0
    if rank == 0:
        print(f"Обновленная серия чисел: {new_data}")

if __name__ == "__main__":
    main()
```

### Описание программы:
1. **Инициализация MPI**: импортируется модуль `MPI` из `mpi4py` и создается объект `comm`, представляющий коммуникатор MPI.
2. **Получение ранга процесса и количества процессов**: каждый процесс получает свой ранг с помощью метода `Get_rank()` и количество процессов с помощью метода `Get_size()`.
3. **Запрос ввода данных на процессе с рангом 0**: если ранг процесса равен 0, запрашивается ввод серии целых чисел у пользователя. Ввод пользователя считывается в строку, разделяется пробелами и преобразуется в список целых чисел. Проверяется, что количество чисел соответствует количеству процессов.
4. **Распределение чисел**: список `data` передается от процесса с рангом 0 всем остальным процессам с помощью функции `comm.scatter`. Каждый процесс получает одно число из списка.
5. **Обработка данных**: каждый процесс увеличивает полученное число на 1.
6. **Сбор обновленных чисел**: обновленные числа собираются обратно на процессе с рангом 0 с помощью функции `comm.gather`.
7. **Вывод данных**: на процессе с рангом 0 выводится исходная и обновленная серия чисел.

### Запуск программы

Для запуска программы с использованием нескольких процессов MPI, выполните следующую команду в командной строке:

```sh
mpiexec -n 4 python your_script.py
```

Здесь `your_script.py` — это имя вашего файла Python, а `-n 4` указывает на запуск программы с четырьмя процессами. Вы можете изменить количество процессов по вашему усмотрению.

### Пример ввода и вывода

Когда вы запускаете программу, на процессе с рангом 0 будет запрошен ввод серии целых чисел:

```
Введите серию целых чисел, разделенных пробелом: 10 20 30 40
```

После ввода числа будут распределены на все процессы, увеличены на 1 и собраны обратно на процессе с рангом 0:

```
Исходная серия чисел: [10, 20, 30, 40]
Обновленная серия чисел: [11, 21, 31, 41]
```

Это подтверждает, что каждый процесс успешно получил одно число из списка, увеличил его на 1 и отправил обратно на процесс с рангом 0, где был собран и выведен обновленный список чисел.