Напишите программу на Python, используя модуль `mpi4py`, которая
запрашивает у пользователя ввод серии целых чисел на процессе с рангом
0, а затем распространяет эти числа на все остальные процессы с помощью
функции `comm.scatter`. Пользователь должен ввести числа через пробел.
После получения числа каждый процесс должен выводить свой ранг и по-
лученное число.


Для реализации программы, использующей `mpi4py` и функцию `comm.scatter` для распределения данных, выполните следующие шаги. Программа будет запрашивать у пользователя ввод серии целых чисел на процессе с рангом 0 и затем распространять эти числа на все остальные процессы.

### Программа

```python
from mpi4py import MPI

def main():
    comm = MPI.COMM_WORLD
    rank = comm.Get_rank()
    size = comm.Get_size()

    # Запрос ввода серии целых чисел на процессе с рангом 0
    if rank == 0:
        user_input = input("Введите серию целых чисел, разделенных пробелом: ")
        data = [int(x) for x in user_input.split()]
        # Убедимся, что количество чисел совпадает с количеством процессов
        if len(data) != size:
            raise ValueError(f"Необходимо ввести ровно {size} целых чисел.")
    else:
        data = None

    # Распределение чисел на все процессы
    number = comm.scatter(data, root=0)

    # Вывод ранга процесса и полученного числа
    print(f"Процесс {rank} получил число: {number}")

if __name__ == "__main__":
    main()
```

### Описание программы:
1. **Инициализация MPI**: импортируется модуль `MPI` из `mpi4py` и создается объект `comm`, представляющий коммуникатор MPI.
2. **Получение ранга процесса и количества процессов**: каждый процесс получает свой ранг с помощью метода `Get_rank()` и количество процессов с помощью метода `Get_size()`.
3. **Запрос ввода данных на процессе с рангом 0**: если ранг процесса равен 0, запрашивается ввод серии целых чисел у пользователя. Ввод пользователя считывается в строку, разделяется пробелами и преобразуется в список целых чисел. Проверяется, что количество чисел соответствует количеству процессов.
4. **Распределение чисел**: список `data` передается от процесса с рангом 0 всем остальным процессам с помощью функции `comm.scatter`. Каждый процесс получает одно число из списка.
5. **Вывод данных**: каждый процесс выводит свой ранг и полученное число.

### Запуск программы

Для запуска программы с использованием нескольких процессов MPI, выполните следующую команду в командной строке:

```sh
mpiexec -n 4 python your_script.py
```

Здесь `your_script.py` — это имя вашего файла Python, а `-n 4` указывает на запуск программы с четырьмя процессами. Вы можете изменить количество процессов по вашему усмотрению.

### Пример ввода и вывода

Когда вы запускаете программу, на процессе с рангом 0 будет запрошен ввод серии целых чисел:

```
Введите серию целых чисел, разделенных пробелом: 10 20 30 40
```

После ввода числа будут распределены на все процессы, и каждый процесс выведет свой ранг и полученное число:

```
Процесс 0 получил число: 10
Процесс 1 получил число: 20
Процесс 2 получил число: 30
Процесс 3 получил число: 40
```

Это подтверждает, что каждый процесс успешно получил одно число из списка, распределенного процессом с рангом 0.

___________
