Напишите программу, которая использует функцию
alltoall, чтобы распределить данные между всеми процессами в коммуника-
торе. Каждый процесс должен создать массив случайных чисел и отправить
его всем другим процессам. Затем каждый процесс должен обработать по-
лученные данные (например, вычислить среднее значение), отсортировать
полученные данные и отправить результаты обратно всем процессам с по-
мощью alltoall. В конце каждый процесс должен вывести исходные и полу-
ченные данные, а также результаты обработки;

Для реализации программы, использующей функцию `alltoall` для распределения данных между всеми процессами в коммуникаторе MPI, выполните следующие шаги. Каждый процесс создаст массив случайных чисел и отправит его всем другим процессам. Затем каждый процесс обработает полученные данные (например, вычислит среднее значение), отсортирует полученные данные и отправит результаты обратно всем процессам с помощью `alltoall`. В конце каждый процесс выведет исходные и полученные данные, а также результаты обработки.

```python
from mpi4py import MPI
import numpy as np

def main():
    comm = MPI.COMM_WORLD
    rank = comm.Get_rank()
    size = comm.Get_size()

    # Создание массива случайных чисел на каждом процессе
    data = np.random.randint(0, 100, size=(size, 5))
    print(f"Процесс {rank}: Исходные данные:\n{data}\n")

    # Распределение данных между всеми процессами
    scattered_data = comm.alltoall(data)

    # Обработка данных (например, вычисление среднего значения)
    mean_values = np.mean(scattered_data, axis=1)
    print(f"Процесс {rank}: Средние значения:\n{mean_values}\n")

    # Сортировка полученных данных
    sorted_data = np.sort(scattered_data, axis=1)

    # Отправка результатов обратно всем процессам
    gathered_data = comm.alltoall(sorted_data)

    # Вывод результатов обработки
    print(f"Процесс {rank}: Полученные данные:\n{gathered_data}\n")

if __name__ == "__main__":
    main()
```

### Описание программы:
1. Инициализация MPI и получение ранга процесса и количества процессов.
2. Создание массива случайных чисел на каждом процессе.
3. Распределение данных между всеми процессами с помощью функции `alltoall`.
4. Обработка данных (например, вычисление среднего значения).
5. Сортировка полученных данных.
6. Отправка отсортированных данных обратно всем процессам с помощью функции `alltoall`.
7. Вывод исходных данных, средних значений и полученных данных каждым процессом.

### Запуск программы
Для запуска программы с использованием нескольких процессов MPI, выполните следующую команду в командной строке:

```sh
mpiexec -n 4 python your_script.py
```

Здесь `your_script.py` — это имя вашего файла Python, а `-n 4` указывает на запуск программы с четырьмя процессами. Вы можете изменить количество процессов по вашему усмотрению.

### Пример вывода
Пример вывода будет зависеть от сгенерированных случайных данных. Каждый процесс выведет исходные данные, средние значения, полученные данные и результаты обработки.
