Напишите программу на Python, используя модуль mpi4py,
которая запрашивает у пользователя ввод серии целых чисел на процессе с
рангом 0, а затем распространяет этот ввод на все остальные процессы с по-
мощью функции comm.bcast. Ввод пользователя должен быть целым чис-
лом. После получения ввода каждый процесс должен выводить свой ранг и
полученный ввод. Убедитесь, что запрос на ввод числа отображается на рус-
ском языке.

Для реализации программы, использующей `mpi4py`, которая запрашивает у пользователя ввод серии целых чисел на процессе с рангом 0 и затем распространяет этот ввод на все остальные процессы, следуйте инструкциям ниже.

### Программа

```python
from mpi4py import MPI

def main():
    comm = MPI.COMM_WORLD
    rank = comm.Get_rank()

    # Запрос ввода серии целых чисел на процессе с рангом 0
    if rank == 0:
        user_input = input("Введите серию целых чисел, разделенных пробелом: ")
        data = [int(x) for x in user_input.split()]
    else:
        data = None

    # Распространение данных на все процессы
    data = comm.bcast(data, root=0)

    # Вывод ранга процесса и полученных данных
    print(f"Процесс {rank} получил данные: {data}")

if __name__ == "__main__":
    main()
```

### Описание программы:
1. **Инициализация MPI**: импортируется модуль `MPI` из `mpi4py` и создается объект `comm`, представляющий коммуникатор MPI.
2. **Получение ранга процесса**: каждый процесс получает свой ранг с помощью метода `Get_rank()`.
3. **Запрос ввода данных на процессе с рангом 0**: если ранг процесса равен 0, запрашивается ввод серии целых чисел у пользователя. Ввод пользователя считывается в строку, разделяется пробелами и преобразуется в список целых чисел.
4. **Распространение данных**: список `data` передается от процесса с рангом 0 всем остальным процессам с помощью функции `comm.bcast`.
5. **Вывод данных**: каждый процесс выводит свой ранг и полученные данные.

### Запуск программы

Для запуска программы с использованием нескольких процессов MPI, выполните следующую команду в командной строке:

```sh
mpiexec -n 4 python your_script.py
```

Здесь `your_script.py` — это имя вашего файла Python, а `-n 4` указывает на запуск программы с четырьмя процессами. Вы можете изменить количество процессов по вашему усмотрению.

### Пример ввода и вывода

Когда вы запускаете программу, на процессе с рангом 0 будет запрошен ввод серии целых чисел:

```
Введите серию целых чисел, разделенных пробелом: 1 2 3 4 5
```

После ввода числа будут распространены на все процессы, и каждый процесс выведет свой ранг и полученные данные:

```
Процесс 0 получил данные: [1, 2, 3, 4, 5]
Процесс 1 получил данные: [1, 2, 3, 4, 5]
Процесс 2 получил данные: [1, 2, 3, 4, 5]
Процесс 3 получил данные: [1, 2, 3, 4, 5]
```

Это подтверждает, что все процессы успешно получили данные, введенные пользователем на процессе с рангом 0.