Напишите программу на Python, используя модуль `mpi4py`, которая
создает список чисел на процессе с рангом 0 и затем распространяет эти
числа на все остальные процессы с помощью функции `comm.scatter`. Каж-
дый процесс должен получить одно число из списка. После получения числа
каждый процесс должен выводить свой ранг и полученное число.

Для реализации программы, использующей `mpi4py` и функцию `comm.scatter` для распределения данных, выполните следующие шаги:

### Программа

```python
from mpi4py import MPI

def main():
    comm = MPI.COMM_WORLD
    rank = comm.Get_rank()
    size = comm.Get_size()

    # Создание списка чисел на процессе с рангом 0
    if rank == 0:
        data = list(range(size))  # Создаем список чисел от 0 до size-1
    else:
        data = None

    # Распределение чисел на все процессы
    number = comm.scatter(data, root=0)

    # Вывод ранга процесса и полученного числа
    print(f"Процесс {rank} получил число: {number}")

if __name__ == "__main__":
    main()
```

### Описание программы:
1. **Инициализация MPI**: импортируется модуль `MPI` из `mpi4py` и создается объект `comm`, представляющий коммуникатор MPI.
2. **Получение ранга процесса и количества процессов**: каждый процесс получает свой ранг с помощью метода `Get_rank()` и количество процессов с помощью метода `Get_size()`.
3. **Создание списка чисел на процессе с рангом 0**: если ранг процесса равен 0, создается список чисел от 0 до `size - 1`, где `size` — это количество процессов.
4. **Распределение чисел**: список `data` передается от процесса с рангом 0 всем остальным процессам с помощью функции `comm.scatter`. Каждый процесс получает одно число из списка.
5. **Вывод данных**: каждый процесс выводит свой ранг и полученное число.

### Запуск программы

Для запуска программы с использованием нескольких процессов MPI, выполните следующую команду в командной строке:

```sh
mpiexec -n 4 python your_script.py
```

Здесь `your_script.py` — это имя вашего файла Python, а `-n 4` указывает на запуск программы с четырьмя процессами. Вы можете изменить количество процессов по вашему усмотрению.

### Пример вывода

Когда вы запускаете программу, каждый процесс выведет свой ранг и полученное число:

```
Процесс 0 получил число: 0
Процесс 1 получил число: 1
Процесс 2 получил число: 2
Процесс 3 получил число: 3
```

Это подтверждает, что каждый процесс успешно получил одно число из списка, распределенного процессом с рангом 0.