Напишите программу на Python, используя модуль mpi4py,
которая создает словарь данных на процессе с рангом 0 и затем распростра-
няет эти данные на все остальные процессы с помощью функ-
ции comm.bcast. Словарь должен содержать два ключа: ‘key1’ и ‘key2’.
‘key1’ должен быть связан со списком, содержащим три элемента: целое
число, вещественное число и комплексное число. ‘key2’ должен быть связан
с кортежем, содержащим две строки. После получения данных каждый про-
цесс должен выводить свой ранг и полученные данные.

Для реализации программы, использующей `mpi4py`, вам потребуется установить модуль `mpi4py`, если он еще не установлен. Вы можете сделать это с помощью следующей команды:

```sh
pip install mpi4py
```

После установки `mpi4py`, создайте программу на Python, которая создает словарь на процессе с рангом 0 и затем распространяет эти данные на все остальные процессы с помощью функции `comm.bcast`.

### Программа

```python
from mpi4py import MPI

def main():
    comm = MPI.COMM_WORLD
    rank = comm.Get_rank()

    # Создание словаря на процессе с рангом 0
    if rank == 0:
        data = {
            'key1': [42, 3.14, 2 + 3j],
            'key2': ('hello', 'world')
        }
    else:
        data = None

    # Распространение данных на все процессы
    data = comm.bcast(data, root=0)

    # Вывод ранга процесса и полученных данных
    print(f"Process {rank} received data: {data}")

if __name__ == "__main__":
    main()
```

### Описание программы:
1. **Инициализация MPI**: импортируется модуль `MPI` из `mpi4py` и создается объект `comm`, представляющий коммуникатор MPI.
2. **Получение ранга процесса**: каждый процесс получает свой ранг с помощью метода `Get_rank()`.
3. **Создание словаря на процессе с рангом 0**: если ранг процесса равен 0, создается словарь `data` с двумя ключами: `key1` и `key2`. `key1` связан со списком, содержащим целое число, вещественное число и комплексное число, а `key2` - с кортежем, содержащим две строки.
4. **Распространение данных**: словарь `data` передается от процесса с рангом 0 всем остальным процессам с помощью функции `comm.bcast`.
5. **Вывод данных**: каждый процесс выводит свой ранг и полученные данные.

### Запуск программы

Для запуска программы с использованием нескольких процессов MPI, выполните следующую команду в командной строке:

```sh
mpiexec -n 4 python your_script.py
```

Здесь `your_script.py` — это имя вашего файла Python, а `-n 4` указывает на запуск программы с четырьмя процессами. Вы можете изменить количество процессов по вашему усмотрению.

### Вывод программы

При запуске программы, каждый процесс выведет свой ранг и полученные данные, например:

```
Process 0 received data: {'key1': [42, 3.14, (2+3j)], 'key2': ('hello', 'world')}
Process 1 received data: {'key1': [42, 3.14, (2+3j)], 'key2': ('hello', 'world')}
Process 2 received data: {'key1': [42, 3.14, (2+3j)], 'key2': ('hello', 'world')}
Process 3 received data: {'key1': [42, 3.14, (2+3j)], 'key2': ('hello', 'world')}
```

Это показывает, что все процессы успешно получили данные, распространившиеся от процесса с рангом 0.